app/Http/Controllers/BookingController.php

    public function get_booking(Request $request)
    {

        $draw                 =         $request->get('draw'); // Internal use
        $start                =         $request->get("start"); // where to start next records for pagination
        $rowPerPage           =         $request->get("length"); // How many recods needed per page for pagination

        $orderArray           =         $request->get('order');
        $columnNameArray      =         $request->get('columns'); // It will give us columns array

        $searchArray          =         $request->get('search');
        $columnIndex          =         $orderArray[0]['column'];  // This will let us know,
        // which column index should be sorted
        // 0 = id, 1 = name, 2 = email , 3 = created_at

        $columnName         =         $columnNameArray[$columnIndex]['data']; // Here we will get column name,
        // Base on the index we get

        $columnSortOrder     =         $orderArray[0]['dir']; // This will get us order direction(ASC/DESC)
        $searchValue         =         $searchArray['value']; // This is search value


        $branch = Booking::where('id', '>', 0);
        $total = $branch->count();

        $totalFilter = Booking::where('id', '>', 0);
        if (!empty($searchValue)) {
            $totalFilter = $totalFilter->where('name', 'like', '%' . $searchValue . '%');
        }
        $totalFilter = $totalFilter->count();
---
select count(*) as aggregate from `bookings` where `id` > 0